[
  {
    "id": 1,
    "company": "Arizona State University — Enterprise Brand Strategy & Management",
    "role": "Data & Editorial Operations Analyst",
    "location": "Tempe, AZ",
    "duration": "Jan 2025 – Present",
    "logo": "/logos/asu.png",
    "description": [
      "Coordinate with the director, editors, and designers to keep ASU Thrive issues on schedule from copy readiness through handoff",
      "Maintain the ASU All Access editorial source of truth, tracking assignments, statuses, and deadlines while surfacing blockers early",
      "Review and proofread ASU Events submissions, fix metadata, verify links and dates, and publish approved entries with zero defects",
      "Enforce ASU brand and accessibility guidelines across copy and images, providing clear feedback and quick fixes to contributors",
      "Partner with QA to triage site issues, reproduce bugs, validate fixes, and communicate updates to stakeholders until resolution",
      "Onboard and support event authors by creating accounts, writing quick how to notes, and answering workflow questions"
    ],
    "achievements": [
      "Recognized with a Sun Award from a colleague for reliable delivery and team support",
      "Contributed to on time magazine releases and a steady weekly publishing cadence across the ASU Events site"
    ],
    "skills": ["Google Docs", "Outlook", "Adobe InCopy and InDesign", "Excel", "CMS workflows", "basic data queries"]
  },
  {
    "id": 2,
    "company": "GlassiaAI",
    "role": "Software Developer",
    "location": "Remote",
    "duration": "Jun 2024 – Dec 2024",
    "logo": "/logos/glassia.png",
    "description": [
      "Engineered multilingual RESTful APIs supporting 10+ languages, reducing latency by 30%.",
      "Developed scalable backend services with Node.js, Flask, and Spring Boot.",
      "Deployed containerized applications with Docker on AWS EC2.",
      "Set up CI/CD pipelines using GitHub Actions for faster and reliable releases."
    ],
    "skills": ["Node.js", "Flask", "Spring Boot", "Docker", "AWS", "CI/CD"]
  },
  {
    "id": 3,
    "company": "NR Crew Pvt. Ltd.",
    "role": "Software Developer Intern",
    "location": "Remote",
    "duration": "Jan 2024 - Jun 2024",
    "logo": "/logos/nrcrew.png",
    "description": [
      "Built e-commerce platform backend with REST APIs and MySQL.",
      "Optimized frontend performance, reducing page load time by 35%.",
      "Collaborated with cross-functional teams to deliver features in sprints."
    ],
    "skills": ["REST APIs", "MySQL", "E-commerce", "Frontend Optimization", "Agile"]
  },
  {
    "id": 4,
    "company": "Techmicra IT Solutions",
    "role": "Data Science Intern",
    "location": "Remote",
    "duration": "Jul 2023 - Aug 2023",
    "logo": "/logos/techmicra.png",
    "description": [
      "Designed and deployed regression models for client reporting.",
      "Built analytics dashboards and interactive visualizations in Python.",
      "Automated ETL workflows to clean and prepare large datasets."
    ],
    "skills": ["Python", "Regression Models", "Data Visualization", "ETL", "Machine Learning"]
  }
]
